# ЗАДАЧА: Последовательностью Фибоначчи называется последовательность чисел a0, a1, ..., an, ..., где
# a0 = 0, a1 = 1, ak = ak-1 + ak-2 (k > 1).
# Требуется найти N-е число Фибоначчи

# def fib(number):
#     if number in [1, 2]:
#         return 1
#     return fib(number - 1) + fib(number - 2)
#
#
# print(fib(int(input('Введите целое число: '))))

# ---------------------------------------------------------------------------------------------------------------

# В одну строку:

# print((x := [0, 1], [x.append(x[-1] + x[-2]) for _ in range(int(input('Введите целое число: ')))])[0])

# ==============================================================================================================

# ЗАДАЧА: Хакер Василий получил доступ к классному журналу и хочет заменить все свои минимальные оценки на максимальные.
# Напишите программу, которая заменяет оценки Василия, но наоборот: все максимальные – на минимальные.

# from random import randint
#
# ratings = []
# count = 10
# for i in range(count):
#     ratings.append(randint(2, 5))
# print(ratings)
#
# for i in range(len(ratings)):
#     if ratings[i] == max(ratings):
#         ratings[i] = min(ratings)
# print(ratings)


# ==============================================================================================================

# ЗАДАЧА:Напишите функцию, которая принимает одно число и проверяет, является ли оно простым
# *Напоминание: Простое число - это число, которое имеет 2 делителя: 1  и n(само число)*

numb = int(input('Введите число: '))
def simple(number: int) -> bool:
    for i in range(3, number, 2):
        if number % i == 0:
            return False
    else:
        return True

if simple(numb):
    print('Простое')
else:print('Не простое ')
