# ЗАДАЧА: Напишите программу, которая принимает на вход строку,
# и отслеживает, сколько раз каждый символ уже встречался.
# Количество повторов добавляется к символам с помощью постфикса формата _n.
# d g h t r g r h t j h b v f d s d f
# d g h t r g_2 r_2 h_2 t_2 j h_3 b v f d_2 s d_3 f_2


# string = 'd g h t r g r h t j h b v f d s d f'
# print(string)
#
# my_list = string.split()   # Преобразовали в список
# my_dict = {}
# new_list = []
#
# for letter in my_list:
#     my_dict[letter] = my_dict.get(letter, 0) + 1
#     if my_dict.get(letter) > 1:
#         new_list.append(letter + '_' + str(my_dict.get(letter)))
#     else:
#         new_list.append(letter)
#
# print(' '.join(new_list))     # записали в виде строки

# ==================================================================================================================

# ЗАДАЧА: Пользователь вводит текст(строка). Словом считается последовательность непробельных символов идущих
# подряд, слова разделены одним или большим числом пробелов.
# Определите, сколько различных слов содержится в этом тексте.

# string = 'sdsd sdsd sdsdf     fsdfg jjk lgg lkjlkjl sdsd'
# my_list = string.split()
# print(my_list)
# my_dict = set(my_list)
# print(my_dict)
# print(len(my_dict))

# ------------------------------------------------------------------------------------------------------------------
# Решение Стоуна:
#
# text = input('Введите текст: ')
# text = text.split()    # Текст привели к списку слов
# text = set(text)       # Список привели к множеству, чтобы оставить только уникальные слова
# print(f' В нашем тексте {len(text)} уникальных слов')       # Выводим длинну списка(количество элементов)


# ==================================================================================================================
# ЗАДАЧА: Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.
# *Пример:*
# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]

# my_list = [1, 2, 3, 5, 1, 5, 3, 10]
# new_list = []
# my_dict = {}
# for n in my_list:
#     my_dict[n] = my_dict.get(n, 0) + 1
# print(my_dict)         # Смотрим получившийся словарь
# for i in my_dict:
#     if my_dict.get(i) == 1:
#         new_list.append(i)
# print(new_list)

# ------------------------------------------------------------------------------------------------------------------
# Решение Стоуна:

# my_list = [1, 2, 3, 5, 1, 5, 3, 10]
# new_list = []
# for item in my_list:
#     if my_list.count(item) == 1:
#         new_list.append(item)
# print(my_list)
# print(f'Уникальные элементы {new_list}')

# ------------------------------------------------------------------------------------------------------------------
# Решение Стоуна 2 через генерато списка:

my_list = [1, 2, 3, 5, 1, 5, 3, 10]

print([letter for letter in my_list if my_list.count(letter) == 1])
